=
}
{
def
new
println
assert
==
//
+
if
->
'
=~
is
)
a
the
return
'''
import
class
#
line
in
+=
to
-
1
print
of
else
and
=>
*
for
it
as
name
<<
[
0
file
string
[]
2
:
?
expected
m
with
]
count
on
"
x
void
private
input
int
4
3,
!=
age
&&
b
out
try
[:]
start
value
from
>
op.accepts(
while
0)
')
static
false
break
not
null
200
public
lines
by
s
you
2,
fish
case
''
60
number
ex)
this
[1,
n
list
sb
at
'\n'
extends
<
have
catch
==~
key
"GET
String
files
3
are
long
result
writer
/
true
size
pattern
0,
y
name,
color
(i
5
was
that
instanceof
||
1,
finder
your
i
implements
<=>
words
dst
(n
hash
))
ch
difference
text
end
or
I
index
(options.wasDetected(
one
fields
1)
10
any
matches
");
be
From:
items
we
p
now
println()
-=
reader
dog
map
two
2006
sleep
HTTP/1.0"
BufferedReader(new
here
(line
people
buffer
(s
options.wasDetected(
an
w
email
v)
then
do
mylist
(Exception
menuItem
System.currentTimeMillis()
(
{}
Random()
};
30
names
like
Dec
4,
my
all
],
null)
a,b
values
am
more
prompt
StringBuffer()
word
after
regex
args
src
-1
filePointer
page
channel
-0400]
24
rand
5,
nb
secs
readUntil(
ignore
use
right
value)
data
code
found
bytes
+0200]
m[0][1]
HTTP/1.1"
than
first
read
amount
file.eachLine{
boolean
4636
left
just
'Exactly
[3,
age,
%
$color
%%
recurse
colors
20
v
7,
arg
//'
stream
something
true;
val
setProperty(String
A
object
has
time
current
(!active)
(?:
bell
b)
next
-1)
*/
'')
total
client
quotes
can
cal
"""
message
only
output
7
str
url
before
seen
path
targets
server
[5,
f
(actionPerformed:{},
millis
checkSuccessfulCopyAndDelete()
head
no
6,
2)
dataOffset
options
To:
store
double
called
Object
8,
This
will
Person
'I
Date:
value,
s2
s1
date
recsize
StringWriter()
followed
6
columns
CharColor(CharColor.BLACK,
last
results
Thread.start{
could
system
stuff
lab
Received:
df
con
reset
personCounter
using
t
throw
-e
Calendar.instance
salary
address
').toList()
addresses
double[]
10,
newlist
100
'cat'
'''(?x)
character
initial
bites
man
db.execute
1:
#!/usr/bin/groovy
seconds
25
members
para
find
8
06/12/31
key,
entry
source
PPC)"
append
"Found
"Mozilla/4.05
writer.toString()
alive
socket
but
(Macintosh;
took
random
""
5]
node
row
(count
123.123.123.123
1005
array
copy
ant
sb.toString()
I;
redOnBlack
sum
c
false;
sort
our
File.separator
(\S+)
k,v
9]
self)
re
login
said,
default:
child,
}.join('\n')
so
years
${new
[0,
method
'sa'
args)
sign,
FROM
set
radioButtonMenuItem
person
fileLength
anything
send
*=
count++
testfile.readLines()
myDbConfig)
does
red
>=
change
printAge()
"This
foodColor.size()
127.0.0.1
myList
'L',
.*
e
host
m.count
paraPattern
System.out
prettyField(secs,
(left)
is:
whitespace
ex.message
16)
<pleac-discuss@lists.sourceforge.net>
myEnv.openDatabase(tx,
item
dir
someone@somewhere.com
'''.trim()
store.insert(new
12
18
get
^
grouper
field
sb)
stripped
single
2000
':'
groovy.xml.MarkupBuilder
(right)
TTY
System.exit(1)
num
been
"I
check
n)
n,
MarkupBuilder(writer)
currentHeader
}.join('
1000
ignore)
port)
pos
testfile
If
lastpos
'the
os
op
what
org.hsqldb.jdbc.jdbcDataSource()
firstname
port
shopMenu()
"http://www.jafsoft.com/asctortf/"
AntBuilder()
while(true)
8)
ois.readObject()
8]
hbox
'betalpha'
record
WebClient()
'groovy
"The
want
"orange",
20)
this.&frontPage,
i686;
PPID
previous
toString()
old
fos
happy
variable
checksum
s,
/bus/libjs/layersmenu-library.js
matcher
records
(?!
676
'It
uid
(it
dropTargetCell
Your
states
see
load
).
<A
String[]
this)
parser
'This
4.0,
args[0]
it.size()
"Action
pets
h
frame
c)
this.name
WINPID
6228
(count)
COMMAND
col
"$x
buf.flip()
tired,
(val
test
interval
d
foodColor
big,
globalArray
augs)
surname
(X11;
'Enter
(pond
'-'
.*?
PARA
"$name
noSuchPage()
default
dbHandle
dtde)
$y"
Sun,
if(
since
base
The
look
PID
some
idx
data.toString()
nodes[name]
info
...'
ordered
nat
Parent
Nov
'Found
;
pairWiseAdd(a,
anonList
places
<target
oldHandler
orig
STIME
logged
U;
frame.pack()
call
TABLE
count)
third
content
}.size()
params
client.replyString
17
0;
jcurses.system.*
three
id
'e')
sampleInterval
recno
template
sweaters
Number)
oos
group
thing
11
PrintWriter(new
16
20,
show
parent
same
Chapter
refers
wasn't
5000
numbers
2:
done
"quick",
input.findAll{
key)
wage
dsde)
May
PGID
body
31
colors)
name)
draggedIndex
line,
states.each{
ref
re)
binfile.eachByte{
boundary
Closure
builder
age:23,
c1:
"the",
actual
buf
tchrist
blue
would
</target>
omta05ps.mx.bigpond.com
%8s
days
ddlist
groovy.sql.Sql
'name',
UID
Sat,
"display
"No
r
(difference
\\b
'The
3868
html
"Opera/8.02
.Se
pets:[dog:'Rover',cat:'Garfield'])
InputStreamReader(System.in)).eachLine{
printCal(cal)
Linux
linefields
$1
writer.close()
en)"
false)
+1100
filefields
192.168.0.1
proc
users
testfile.eachLine{
Date()
"-"
unknown
shallow
[04/Sep/2005:20:50:31
table
setter
prefix
trimtail("abc
"brown",
ArrayList
meadow2
null,
kids
k
9,
"))
['Crosby',
"println
diagHandler)
non-capturing
.
tcount
usually
DatabaseConfig()
inside
150
push
cli.parse(args)
op.parse(args)
int[]
sign
proc.waitFor()
maxDataOffset].min()
(new
byte
finalize()
logfile,
'Stills',
jcurses.system.Toolkit
sizes)
finder[0]
createList()
hostname
it.trim()
(b
'Is
yyyy
Signal.handle(new
Toolkit.screenWidth
ac
"other"
client.getPage('http://www.perl.com/CPAN/')
myEnv
[])
tx
net.sourceforge.pbeans.*
typed:
t1
frame.show()
full
action
BufferedOutputStream(new
shirts
maxBounds
it;
"that",
urlStr
Class
joptsimple.OptionParser()
(char)
head{
_saved
'hibiscus'
ext
session
factor
waittime
sec
[2,
whole
(f.isFile())
format
</html>
continue
methods
Environment(envHome,
colors[0]
com.sleepycat.je.*
foodColorsSortedByFood
scratch
tr{
"next
items[0]
wondrous"
lock
pieces
delay
move
_age
Match
newmap
com.gargoylesoftware.htmlunit.WebClient
length
Store(ds)
Persistent
diagHandler
maxDataOffset
v1
v2
[6,
(also
5.times{
(os
timestamp()
dummyContent
OperationStatus.SUCCESS)
/(?=(?:(?!BAD).)*$)GOOD/)
myDbConfig
work
sanitized
Will
another
Pike
target
'Greenwich'
Level
ds
(idx
"this",
/Mom
DiagSignalHandler()
$newlist"
java.text.DateFormat
myEnvConfig)
uid,
MMM
explicit
Jan
RandomAccessFile(file,
There
friend
begin
while(
printUsers(store,
<mkdir
close()
'jdbc:hsqldb:hsql://localhost/mydb'
newpos
/usr/bin/ps
-l
BinaryTree(val)
chunks
taken
"$mylist
myEnv.close()
isn't
script
getter
sentences
alpha
nostdout
HashMap
initValue(value)
test'
foodColor['Lemon']
options.nonOptionArguments()
empty
1000)
-tcsh
...
randomaccess.seek(address)
list.each{
"$_"
dropTarget)
A6
As
LockMode.DEFAULT)
--Rob
PrintStream(new
panel
'\n>
/usr/bin/bash
buttonGroup:group)
myEnvConfig
need
lines.join('\n')
based
processed
And
capture
<body>
size)
"2",
ds.user
modifiers
chopFirst
$line"
(?=
s.split('\n').toList().collect{
client.disconnect()
it)
-0800
byte[])
ds.database
DiagSignalHandler
EXPR
data)
System.err.println
reference
hash.each
subject
filename
binfile.createNewFile()
EXCLUDE
yet
paragraph.
form
Object[]
password
skip
anArray
addr
perm
builder.html
switch
.Ch
1]
reader.readLine())
myEnvConfig.setAllowCreate(true)
'Found:
'No
cli
"rw")
pat
ois
colinc
ds.password
regex)
cal.time
Signal("INT"),
"Ralph",
"yellow"]
System.getProperty('line.separator')
2]
Bad
System.exit(0)
"0"
part
},
ttyp1
headers
k,
order:
orderText()
lines[-1]
permission
common
"not
create
EnvironmentConfig()
theKey,
options.valueOf(
"There
Java
301
303
cal.timeZone
query
3]
hh:mm:ss
implicit
32
look-ahead
getString(buf,32)
day
TimeNumber(0,
</body>
myDbConfig.setAllowCreate(true)
line/para
(word
child.
min
while((next
Some
"abc
hash["a
(dtde.source
\n'
process(page)
40
append,
must
me
(index
files.each{
author',
key"]
binfile.delete();
PipedInputStream()
too
"You
color)
rowinc
capacity
adage
containing
greeted
";
/bus
50
addFactor
('a'..'z').each{
when
SignalHandler
ESC
comments
['XL',
Subject:
goes
File("D:/Projects/GroovyExamples/Pleac/data/db")
REGEX
outdb)
FILE
writer.println()
groovyUnwrap(names)
"vendorDB",
'IBM'
/\b$it\b/
closure
Runtime.runtime.freeMemory()
XXX
driver
It
CharColor.WHITE)
envHome
'green'
tee
System.err.println("Could
flag
cursize
"Last
refresh
states.collect{
${
$x
$y
RandomAccessFile(
myHash
('Log
sizes
channel.close()
chars
args[1..-1]
input(type:'text',
rows
Cc:
z
row,
counterMaker()
"An",
"Number
%=
write
80
f->
which
true)
"Flies",
catch(java.text.ParseException
temp
groovy.swing.SwingBuilder
yellow
four
'sort
ignore_ints
'CREATE
Paul
headerfied
second
(hop
'You
o_nomatch
menu
parser.parse(new
"case
(pos
checkUrl(page,
simple.template
}*.name
hot
replacement.'''
LS
(kid
zero-width
\[([^:]+):(\d+:\d+:\d+)
Card:
Math.log(base)
closed.
debug
totalColors
rp
server.accept()
silicon
r,
meadow1
char[]
'Book
'''I
was:
addUsers(store)
FileOutputStream(binfile).channel
displayFiles(params,
tree
b.p("""You
args.each{
Bank
$total
dummy
addr,
gives:
x1
file.text
green,
".suffix")
session.createSharedMemory("myBuffer",
ex.getMessage().contains('abc')
hiding'
vbox
256
aren't
much
'Jackson')
</BODY></HTML>
'-a':
string[-1]
'Engineer'
filename"
'verbose',
mail.sourceforge.net
chainedmapper{
mylist.clone()
locationToIndex(dtde.location)
"groovy
possibly
')}."
factors[x]
foo
\\s+
NONAME
s.size()
width
so,
back
myMethod2()
';
',
CharColor.BLUE,
DatabaseEntry("data".getBytes("UTF-8"))
Sincerely,
'a
InputStreamReader(pipe))
'''.split('\n').findAll{it.trim()}
15]
getOrCreateNode(name)
hash[750]
Sql(source)
choice
sigs
"pleac11")
['Black',
fifth
tempFile
Mr
SECONDS_PER_YEAR
href="$1">$1</a>')
mutex.lock()
value.
angry
value:
tailing
b.br()
buffer.length)
{a,b
following
s)
TCOUNT
Person5()
lock,
st
(!(color
patterns)
System.out.close()
Math.random()
"Cherry"]
employeeId
p("You
response.setContentType('text/plain')
!(string
DOMParser()
color2html.yellow('error')
'reviver']
"${i}:
EMT
MathLib
"Extra
StreamTokenizer.TT_EOF)
take
datetime
<html><head>
groovy
ipregex
'two',
worried
(!x)
where
up
fis
processStream(random)
other.places].max())
deathly
cli.v(longOpt:
[dataOffset,
3000
enable
'Customized
title('chemiserie
byteCount
binding."log$base"
(r
(j
(a
(f
Sweater:
mydict
grouping
li(it)
(states[page])
partial)
favorite
burning
(args.size()
byte[]
System.getProperty('user.name')
glue()
descendingBySecondLastLetter
a)
df.format(cal.time)
formatOffset
splicing
cal.set(1973,
(in
<error-page>
hour'
bne012m.server-web.com
Banana:'yellow',
Orwant"
"Like",
Orwant'
Augmentations
"Selection:"
3456
fade(r
initiates
-3.0]
hello()
13:53:32
'To
foundData
information
FixNum(value
chars[0]
cookie.maxAge
label("How
org.apache.xerces.xni.parser.XMLDocumentFilter
hasFocus)
yellow'
sc8-sf-list2-new.sourcefo
"newline"
sizes[0]
file.filePointer
firstDate
[12,
from[sender]
mylist[0][0]
maxSize)
sun.jdbc.odbc.JdbcOdbcDriver
P.S.
97,
df1
df2
df)
"$pazzi.name
'alphabeta'
internal
Groovy
M
client.logout()
(int)
"(${parts[0][it]})
ansi(31)
'blah
[Pleac-discuss]
!to.exists()
DatabaseEntry()
)*
doubles)
'Green'
Card
(matcher.matches())
value.toString()
pound
<=
binding
(size)
Cancel:
extractHeaders(mail)
<a
HREF="pictures.html">pictures</A>
ONE_HOUR
109,
SwingBuilder()
sorting
dialog.dispose()
reader:
(value
(0..<finder.count).each
b1
b2
InetAddress.getAllByName(name)
b;
a.size()
"Object
getCookieValue(request.cookies,
$username</TITLE></HEAD>
char
firstSender,
provided
ustr
Moon')
partial
DateCategory
name;
seen[cpath]
!(meadow1
'$s'"
MultiStream
great
template()
'omega'
duplicate
'-i':
[4,
(m)
gamma'
high
'Jon
negation
counter
tempFile.exists()
pop3.disconnect()
WHERE
writer.write(
org.cyberneko.html.filters.DefaultFilter
lastModified
employees.findAll{
SMTPClient()
-1]
fakeFileInput
"Hello
does:'book
'alpha'
["Time",
SIZE_OPTION
sc8-sf-list2-new.sourceforge.net
children[v]
50]))
bree
"sample"
(page
THREE_MONTHS
Robinson!'
'pot'
processStream)
value:name)
}.join('|')
intervening
<BLINK>He's
ends
Thread[]
'23rd
Heading</h1>
streams
appendFlag)
(meadow2
"$color
loginCount
'^'
patterns
command
name",
dest
Writer()
stripExpectations
'One
$count
HREF="shergold.html">Please
MultiStream(List
DatagramPacket(buffer,
(!(size
'ponder
files.max{
letters
mere
function
'horse']
PipedOutputStream(pipe))))
/^(\S+)
Matrix([
repeat
minDataOffset
'Danger,
ByteBuffer.allocate(24)
toPage("Shirt")
ALT="Good
3:45:50
'Nash',
said:
org.cyberneko.html.parsers.SAXParser()
02:14:57
(row
a2)
outdb.out(tx,
AntBuilder().fileScanner
parser.setFeature('http://xml.org/sax/features/namespaces',
HELP_OPTION
they
have"
16:02'
4096)
$desiredLine:
DatagramSocket()
creates
node.size
o){}
file.readLine())
this.&creditCard,
programs
makeSomeFriends()
ponder
--Dennis
him.<P>
filtermapper(){
hr()
(params.size()
dd
'Debugging
db
(11..100).each
source.database
['client','identuser','authuser','date','time','tz','method','url','protocol','status','bytes']
sb.toString().trim()
LOGFILE
Serializable
connection.responseCode
'S']
c2:
anonList[3..5]
ANSIBuffer.ANSICodes.attrib(0)
skipping
while(1)
punctuation
"$k
"$z
m.food
session.close()
finder[it][1]
buildFont(name,
this.&sweater,
lines[r]
'cmd
"red",
ob2
ob1
label("Size?");
targets.each{
float
"And
01:14:57
3.5,
dying
['a',
getInt(buf,4)
headerfyExpectations
brown
count[it]
buttonGroup()
shared
'''Folding
Dear
"Output
$username</H1>
08:24:50
cap
cat
DatabaseEntry("key".getBytes("UTF-8"))
select2
select1
date(b)
["black",
ghi
cols
[100,
form{
domain
year
looking
variables
isHeader
'e'
packet
'potamus'
'Young']
gnat
ratio
DataFlavor[]
getProperty(String
java.text.SimpleDateFormat
(faster
lock.release()
(lock
cal.set(1981,
org.cyberneko.html.parsers.DOMParser
seen[x]
name:name,
[25,
XMLDocumentFilter[]
'T',
Mary
operator
this.ddlist
Integer
<!--
ImportantHash(),
embedded
op.printHelpOn(
scanner
60,
string)
'Tom
$z.places
'White']
source.readLine().toUpperCase()
nodes
client.connect(
"(\S+)
$alpha.maxBounds"
dupWordPattern
other.value,
myDb.close()
request.getParameter(name)
ahead
real
'-n':
JIPCClientFactory.instance
(st.nextToken()
contains
next()
<?xml
'/'
recsize)
sizes))
f.name
[["1",
"My
$username
Math.log(n)
dream
maxcol
lines[0]
full)
randomaccess
evens
3],
foodButNotCitrus
'Decimal
dirs
map[key]
</head>
minutes.
MATCH
God
org.xml.sax.InputSource
~/(?mx)<b><i>(
quote
'Peter
0.30s
tree.
assertion
option(value:it,
p.name
pleac-discuss@lists.sourceforge.net;
Today,
super()
determination
"Cat"]
store.selectSingle(Person.class,
fcrawler.looksmart.com
input(type:'submit')
uses
user
'))
'.'
signal
guanacos."
guanacos.'
5])
[3.0,
77
PrevaylerFactory.createPrevayler(new
block
shopping.")
fish'
this.age
col(commandIdx,
o_tcount
mobile
"print
FixedArray()
A5
InetAddress.getByName("localhost")
"\nSearch?"
excludes
g)
$b"
'bites',
Z').parse(date)
remains
'yellow',
revwords
meet
escaped
matchAll(it,
printAllUsers(store)
node.kids
front
(currentHeader)
InputStreamReader(System.in))
<p>
|
chunk
"It
myMethod()
index,
ill.
times
buttonGroup:group,
management
WORD
final
'r').channel
'Kirk')
problemFileNames
2.0
'red,
'are
EXACT
Psalm'
12]
"Fred"]
neither
${lines[i]}"
Person10
(numCols
0.43s
"vi
RandomAccessFile(binfile,
username
anyFish)
"r"
parts
/*
part.
'bisc'
26,
(MalformedURLException
home
matchAny(it,
before,
(mail
anyFish
"20",
org.apache.xerces.xni.*
this.&order,
retrieve
[new
~/(?<=\D)(\d+)/
<dependency>
[26/Apr/2000:00:23:48
display
Toolkit.clearScreen(color)
$color"
Visited:
StringReader(input)))
'display
Order:
CliBuilder()
friends
update:
recycle
[1.4,
VALUES
DEBUG
10]
10)
org.cyberneko.html.filters.Writer
b.p("You
typo
this.&checkout,
<HTML><HEAD><TITLE>Hi!</TITLE></HEAD><BODY>
give
foundData,
foundData)
food'
'-u':
staff.sort
"Jason
,
'red
h1('Search')
mean
World!</H1>
available'
1s
log100(1000000)
starts
messages
put(name,
UnderscoreAware
keyword
electrons!'''
(cursor.getNext(foundKey,
modern
seed
'3',
REVERSE_OPTION
cal.get(Calendar.YEAR)
13
bad
-0000
0:
<IMG
oos.writeObject(new
people.size()
sort)
channel.position()
urls
channel.read(buf)
loaded
set")
socket.send(packet)
"http://localhost/bus/"
employees
"Return"
deleteFiles(files)
make
unpack('A5
DefaultFilter
i)
kid
butter
origAge
evaluate(code)
email:'tchrist@perl.com'))
greenOnCyanBlink
hopDate
dtde.rejectDrag()
reversed,
exclaimRegex
unbuffer
0).toInteger()
ignoreErrors
info)
astart
recsize.times{
"One
dbUrl
Publishing
Checkout:
Person7
Person8
editor,
System.setOut(new
there!</title>
112,
StreamingMarkupBuilder().bind(m).toString()
h1('Results')
(ashen@looksmart.net)"
factory.create('localhost',
boy
"list
foundKey,
sizeMinusOne(thing)
line.size()
crazy
input,
LOGFILE.trim().split('\n').each{
INVERT
'''.trim().split('\n')
oldlines
pointer
long_palindromes
<property
plus(other)
'DROP
listing'
romans
prevDate
topdir
'<'
were
(item
citrusColor
normal
INTO
beta
pair
black
$file.name"
murrayHillRegex
greekAlpha
2.9999999999999996
HELP
['hippo',
</error-page>
788
})
[internal
decimalPattern
Toolkit.screenHeight
Default:
different
'dog'
File(basedir)
markup
connection.connect()
it.toUpperCase())
found,
sepchar
/alpha|beta/
System.in.text.toUpperCase()"'.execute()
specified
store.prevalentSystem()
phrases',
out,
strip
Signal("INT"))
Random(seed)
toPage("Sweater")
deep
@@pleac@@_10x
ServerSocket(5000)
100.times{
prefixed
m.matches()
myDb.put(tx,
fivers
20th
hero!</BLINK>
zero
6.7]
stood
diag
MODIFY_OPTION
linkRegex
Core
'means',
hour
synchronized
(col
response
lookahead
27
orignums
21
23
'v';
good
freemem,
CharColor.CYAN,
response.addCookie(cookie)
super.setProperty(n,v)
'river',
18,
180
"3"]
'localFilename')
Date()}"
<project
(addValueOrSize(10,
age)
</p>
g.childName
dir.eachFileRecurse{
message')
override
separator()
"Jim",
mylist[0]
(m
f.canonicalPath
SRC="scooby.jpg"
please
"Arrow"]
'make
pleac-discuss-bounces@lists.sourceforge.net
point
price:
Ritchie
key:
libdirs
it[0]
lenient
60)
to.delete()
"${counter1()}
alternative
('
often
fakedInput
continuing
['cat','dog'])
bstart
firstLetters
'r'
functionality
'red',
WITHF
"User
/<a
us.
108,
access
-2)
-----
3:
33
35
34
"Jon
seen[w]
dropTarget
reset)
account
theKey
CharColor.GREEN,
e.g.
foodColor.each
line"
[-ainu]
collection
Date().toString()
Scooby
'Output
${p.peers[0]}"
attributes)
(rp)
attributes,
rev
</dependency>
"can
Date(file.lastModified())
win2K001
g.grandChildName
cards</A>.
words.split('\n').findAll{it.trim()}.each{
acquire
["Jack",
[a:1,
"It's
[7,
(age.containsKey(key)
hidden(name,
readEmbeddedInfo()
["red",
chunkyPattern
store')
LONG_OPTION
'$'
$r"
comment
DEFAULT_PLACES
Example')
getName(){
examplePattern
(Exim
/(?=.*alpha)(?=.*beta)/
['100',
{new
.*?)
age:23)
add
colors))
esmtp
((f
repaint()
foo(){
source.user
about
December
//=>
[05/Sep/2005:20:50:36
Compare
buffered,
4:
42
4)
category
4]
bundle
File.createTempFile("prefix",
Sleep
C/Posix/GNU
'1/01/00
dtde.rejectDrop()
startsWithCapital(person)
"an
tom2.does
"FAST-WebCrawler/2.1-pre2
every
tty2
tty1
"3"],
integerPattern
/alpha/
COUNT
digits
printf
m,
url.openConnection()
getInfo()
File('localFolder'
includes[file.name]
VARCHAR,
doggy!"><P>
NOCASE
Here
mutex.unlock()
each
day,
PrintStream
'M',
CharColor.YELLOW,
cursor
hash.capacity()
jline.ANSIBuffer
Unit
a1[it]
setUpFromFile()
peers
parser.setProperty("http://cyberneko.org/html/properties/filters",
WITHN
lines.sort{
Big
'x'
'Peter'
StreamTokenizer(testfile.newReader())
search
"Bound
href="$1">$1<\/a>/)
tokenLen
")
outFile
descending
(DateCategory)
55
oldlines.size()
5)
staff.findAll
deleted
session.createMutex("myMutex",
longFormat,
date(a)
timeoutMillis
StringBuffer(string)
maxcol,
"Fort
"Banana"]
picture
sqi
"Banana",
"his
Title
one!<P>
[^<]*
quick
file.canonicalPath
Re:
?'Y':'N'
delimiter
handler
candidates
Time
values.each{
needs
runtime
println(String
firstname,
anonList[idx]
NOMATCH
Math.PI
factors
factory
[27/Apr/2000:00:23:51
END
myDb
swing
}.join()
given
returns
</project>
dragSource
matcher[0][1]
'YYYYYYYYYN'
selected:true)
multiple
noWaldoRegex
"last
10.times{
random.close()
${c1["NEXT"]()}"
m.group()
outside
<BODY><H1>Report
"Jill"]
\\#
way'
colon
this.dump()
protocol:
500
6]
'recycle
$p.age,
<title>Howdy
hermie
URL
week
includeStdout
Is
b:2,
.Ss
c:3]
sanity
getString(buf,256)
Employee
'Size
<HTML><HEAD><TITLE>Report
label("Color?");
htmlContent
strict
"Age
(args[0]
START
DatagramPacket(data,
calls
randomaccess.read()
directory
2.times{
program
ByteBuffer.allocate(recsize)
"<FONT
version
romanMap[key]
Many?");
File(inputPath)
data.length,
Tom
Recipient
'Press
a2.size()
pond
You
nums
[places,
'p',
unpack(format,
'dead'}."
theData
System.gc()
don't
"if
wtmp.size()
compareTo(other)
closure(page
cookie
3.0,
scanner)
$_
].unique()
(options.v)
7]
"fox",
windows
while(!done)
${finder[0][1]}"
theData)
him
"give
string[0]
"At
o_count
((char)buf.get())
inputStream
find:
after)
days,
["A",
foodsOfColor
o_match
newnode
autoFlush)
TimeZone.getTimeZone("UTC")
"Line
p1
it?.close()
(1..parts.groupCount()).each{
9
\"glug\"
items)
items,
length)
bounced
places"
'alive'
usPhoneRegex
"usage:
Last
cursor.close()
invokeMethod(String
integer
['cat$','^n.*'])
3.0
(color)
(\S+).*$/
//new
[$a]"
redOnYellow
(displays
setUpToFile()
["the",
aref.size()
blah'
'14/03/73
'Yellow'
Thread.sleep(
["Wilbur",
'Go
bytes"
overlaps
week's
unpack("x6
myMap
lines.size()
org.garret.jipc.client.JIPCClientFactory
[Apple:'red',
socket.withStreams
htmlStr
himself.
tab
made
nextChar();
email:'boutell@boutell.com'))
[\\w-]
logfile.size()
isTargetCell
menu(mnemonic:'F',
owe
XmlParser(parser).parse('http://www.perl.com/CPAN/')
times,
names.each{
it[1]
/beta/
Toolkit.readCharacter()
getSystemInfo()
1500
File(args[0]).eachByte{
toDigits(s)
[04/Sep/2005:20:50:36
(m.matches())
pipe
Here's
6000
mutex
([^\]]+)\]
maxrow
employee
"INSERT
double[][])
"UTF-8")
Jun
Person(name:'Tom
processWithBackup(testPath)
literal
log20(400)
id=${hashCode()}]
$p.name's
InputSource(new
source.password
connection
Shirt:
oos.writeObject(map)
getDate(buf)
sdev
only"
randomaccess.close()
bindingVar
StreamingMarkupBuilder().bind(markup).toString()
<H1>Welcome
(st.ttype
romanMap.keySet().sort().reverse().each{
);'
(.*?)
ByteArrayOutputStream()
-->
other
<\/i><\/b>/
(\S+)"
"Thu",
channel.position(size)
'Moderated',
"brown"]
candidates)
hidden("sweater_size",
kids[0].size.toString().size()
$numbers
SPC
['one',
digit
(driver
writing:
...')
'POST')
'/')
Christiansen',
step=10)
outer(10)
ReverseMap.fromAddress(hostIp)
'vanilla
numWords)
one.'))
persisted
USR2
USR1
indb2.close()
shift2()
hæmoglobin
mbh.triple([4,
${options.o}"
27,
ppidIdx
[1,2]
client.sendMessageData()
y=$y;
null;
understood,
Raspberry
e'
HttpClient()
(!buffered)
glass.
m.twice(10)
subjectExcludingReplyPrefix(b)
super.getListCellRendererComponent(list,
b.input(type:'text',
positions)
channel.tryLock()
bstart)
Harvey
replace
size.width.intValue(),
text.toString().replaceAll(before,
files,
dragGestureRecognized(DragGestureEvent
ObjectOutputStream(fos)
files'
$logfile"
text.replaceAll(/(?m)DATE/,
'/usr/bin/vi'
until
textfield(name)
"/",
1.04,
hurt
99
pop3.listMessages()
string[5..6]
Integer")
'exclude
'Melon'
2\nline\r\nline
setCellRenderer(new
t.runAfter(3500){
Math.pow(2,
label(text)
para.replaceAll(/(?m)^(>.*?)$/,
"Aron
sun.misc.Signal
webClient
/blue/)
href="http://groovy.codehaus.org">http://groovy.codehaus.org</a>
sorted[0..5].each{
Banana:
store.connect()
how
hop
'28']
'Doing
a.eachWithIndex{
BufferedReader(reader),
dest.delete()
37000,
0..<m.size().toInteger())
path.name
greeting('harry')
origpos
Cart')
ReflectionToStringBuilder.toString(this)
label("Zip:
File(filename).withOutputStream{
HrefReplaceFilter
20.times{
vars
"rw"
'bad
channel.size()
proc1
${lines[desiredLine-1]}"
"localhost"
proc2
/\u00E0/)
salute()
dispatcher.forward(request,
input.split('\n').findAll{it.trim()}.each{
CanFlicker().invokeMethod(methname,
ready'
hidden
easier
test.postOrder();
there!'
"HAL".toCharArray().collect{new
~/(?mx)<b><i>(.*?)<\/i><\/b>/
var,
setAge(value)
[3.5,
(?!<\/[ib]>).
lines.remove(3)
(m[0][fields.indexOf('bytes')+1]).toInteger()
ring
[0.5,
TreeMap()
self,
/\\b$it\\b/)
basedir
inplace
~/^\s*$/:
Shirt
20..30))
theKey)
'<b><i>this</i>
chars[random.nextInt(chars.size())]
metrics.collect{
cal.get(Calendar.DAY_OF_YEAR)
symbols.amPmStrings.toList()
1\rline
nonBlankLines
r1
r2
it.toLowerCase()
translations.each{
/(?sm).*(SYDNEY.*?)$/)
o_withf
17)
o_withn
Please
"Austin",
06:23:34
{a,b->
06:23:39
webClient.getPage('http://search.cpan.org/')
\/>/)
addresses.each{
'Cut')
listed
me,
(options.o)
'(?i)^'
g.setColor(Color.black)
refresh)
freemem
Mary'.split('
Float)
Carrot:'orange']
17]
old'
(paraPattern)
"Lake
${kid.parent.name}"
"1729
size.times{b+=buf.get()};
CanFlicker().metaClass.methods*.name.contains('flicker')
exclude(name:'**/*Test*',
cal.get(Calendar.DAY_OF_YEAR);
Component
age['Nat']
indb1.openCursor(null,
tab.herOine
$empl.age
names.collect{
metrics
90:'XC',
whois.connect(WhoisClient.DEFAULT_HOST)
letter
socket.send(outgoing)
(f.isDirectory())
"values
attributes.getIndex('href')
'/usr/bin
string.replace(/o*/,
['ALL'])
|\Z)/
'anonymous',
'Quit
rintExpected[i]
/\pL\pM*/)
www.perl.com/208.201.239.36
getName()
paras."
INFO
DClass.IN)
factorize(BigInteger
printCal
early."
employeeId:12349876)
name1)
InputStreamReader(System.in)).readLine()
Math.abs(date2.time
datafile
'''(?xms)
textfield("Address1")
'reverse
mandatory
dragDropEnd(DragSourceDropEvent
'Full
"invoking
password))
InetAddress.localHost.canonicalHostName
best
ftp.connect(
'(?sm)'
StreamTokenizer.TT_WORD)
</jar>
Record.newRecord(name,
<george@wash.dc.gov>
glob2pat(globstr)
debt
(fakedInput
s.readLines()
Wednesday,
files.size()
30th
$tom2"
'output',
250
257
put(name.toLowerCase(),
outdb.close()
salary:200)
lines[1..-1].each{
GreeterTest
options.
(evaluate(code))
telnet
Clinton',
Phantasm:null]
"$it.uid
(!nodes.containsKey(name))
textfield("Card")
line.replaceAll(/(?<=\\)\s*$/,
FixNum(value,
'Could
encodeEmail(email)
"db1",
Dumped"/
pleac_7_6_embeddedFileInfo
"$it.name,
label("Color:
Capital
i])
'Mr
System.in.readLine()
(parent)
File(name
cal.get(Calendar.DATE))
filenames
jkl
to')
tuna
nested[2].size()
sc8-sf-spam2.sourceforge.
processWtmpRecords(wtmp,
["o":3,
thing'
'com.mckoi.JDBCDriver',
dosomething
register(event)
println("There
rotated
File(options.valueOf(
args.size()
capwords
table(border:1){
(!(value
previous,
ham
process()
out('Sender
'com.informix.jdbc.IfxDriver',
555-0123
Known')
(table.containsKey(line))
e.realName
ORIGINAL
dirsizes
allDigits
"Wed",
MakeBiggerHelper
oreo.maxAge
$from.canonicalPath
(digits
<description>Greeter
String([115,
left,
%10s\n",
{it.next()})
b.p()
key1:100,
"DIR
fox
'dbuser',
<artifactId>commons-collections</artifactId>
yyyy')
(66.35.250.225)
ansi(40)
hypotenuse(*a)
other.name
symbols.months.toList()[0..11]
\\s*
Static
'And
${value/other.value}"
Cookies')
menuBar
includes:params.join(','),
right?
mbh
groovyc
'abc%3cdef'.replaceAll(escapeSequenceRegex,
$file".execute()
++counter
name:".State",
'CO
page.getFormByName('f')
fakedFile.replaceAll(/(?m)<.*?>/,'').trim()
basedir=".">
support
symbols.weekdays.toList()[1..7]
options.arguments()
else')
["abc":
[a,b,c,d,e,f,g])
OK\n"
(line.contains('\t'))
getAt(key)
#$it
foodColor.values().sort()
${urlInfo[key]}"
Math.sqrt(side1**2
Person11('James',
frame.contentPane.add(sp)
'That
check:'
0..<rows)
'5
addValueOrSize(a1,
'2
'1
exist
left.insert(val)
p('Which
'-
15,
File(file).eachLine{
0.44s
nextChar()
'mint')
string.split('
Date(83,03,04),
'w
Math.log(Math.E)
(regex)
'|
'x
sigs.tokenize('
titleBytes(urlStr)
']
org.apache.commons.net.telnet.TelnetClient
DEBUG,
'A
"Example
1981,
citrusColor.keySet().toList()
'Lee
indb2
[-_]
/^([01]?\d\d|2[0-4]\d|25[0-5])\.([01]?\d\d|2[0-4]\d|25[0-5])\./
datafile.size()
provided,
z=$z"
localPort)
Yellow:['Banana',
yeslap[it][1]
bundle["PREV"]
td(row.name);
${date(row,'LastVisitDate')}"
e.name
other.initial
InetAddress.getByName("web.mit.edu")
cookname,
foods.size()
$y,
$sum
[colour:'color',
['-n','-a','file1','file2']
minute
'pop.myisp.com'
header.toString()
calcPrice()
age."Jules"
"${a*b}
phrases;
sum(a,b){
e.position
org.apache.commons.net.smtp.*
FilenameFilter)
'\\d')
out.write('')
putAt(key,
'you'
ImportantHash
/.:?\-/
/../
Letter',
s.tokenize()[n]
shirt!
s.what.get(url,
width=0)
pop3.setDefaultTimeout(timeoutMillis)
My
members[3..4]
MI
writer.println("10")
s.what[url]
states[state].sort().each{
Double)
s.what.size(),
fake
(draggedIndex
August
highestEngineer
"$dude.name
Date()).time
fourth.
pre(message)
1540096
'2007-2-28'
name.replaceAll(/.*\//,
Default
random1
random2
client.executeMethod(head)
"ondrous"
[en]C-SYMPA
total:answer[1]))
${a*b}"
dragExit(DropTargetEvent
foods
/^(?:(?!beta).)*$/)
"Successfully
23,
'${value}'
pw.println(next)
"old
/(?im)<A[^>]+?HREF\s*=\s*["']?([^'"
'^(?!.*ttyp).*tchrist'}
autoFlush
ansi(code)
235
Hume
(int)(secs
sum(a,b,c){
src.replaceFirst('this',
actionPerformed:this.&cancel)
').toList().reverse().join('
fishInPond
s]
blasting
typography.
socket.shutdownOutput()
'\t'
such
"${fields[idx]}=${m[0][idx+1]}"
ant.ftp(action:'send',
sp
it.key
Lamech:'Methusael',
URLEncoder.encode(email)
'Oh
$socketAddress.hostName,
IllegalArgumentException("Age
'no-cache')
w2)
['alpha','omega'].each
miniGrepMethod(input)
').each{
Employee(name:'Jill',position:'Engineer',salary:24000),
file.seek(
System.err])
sorted
\
matched
/\b([A-Za-z]+)\b/
ALRM
peons.size()
items.reverseEach{
400:'CD',
square
file(s):
to:'')
deck,",
next)
you)'.replaceAll(simpleCommentStripper,
file(s)"
'2**19
System.exit(
super(f,i,s)
'Ruth']
(0..<n.size()).each{
!unbuffer
one."
one.'
newarray
namelist
uk.ac.shef.wit.simmetrics.similaritymetrics.*
you?"
FileInputStream(binfile).channel
punc
[26/Apr/2000:00:16:12
'''.trim().split(/\n/)
align="left">$1<\/th><td>$2<\/td><\/tr>/);
Object[])
$subject"
this.streams
pw.close()
DropTargetListener,
dragOver(DragSourceDragEvent
nested
("ABORT"
(0..299).each
this.&addAndMultiply
BigDecimal.ROUND_HALF_UP);
Employee(name:'Jim',position:'Manager',salary:26000),
Character.toLowerCase(ch)
result.anchors.any{
Monday
/(\S.*?\p{Punct})(?=
(!regex
3*24*60*60*1000)
line[3]
much.
address.isReachable(timeoutMillis)
padding
showSelected
source.remove(next)
file')
Pascal:
cookies[i].name)
Lime:'green']
param,
numlines
setModel(model)
string'.class
javax.swing.JOptionPane
finder.matches()
GroovyInterceptable
string.replaceFirst(/o*/,
"$url
bad,
(w)
'be']
pretty(factors)
'.5'
/(?i)mac.*/)
capwords[it][1]
40:'XL',
cnn.com/not.there
oldlist
'Class
setgrandChildName(value)
0.8f)
((count
(lines)
'Larry
"PRIME"
File('/createme').exists()
RuntimeException('The
god!''.
randomCase(char
Lover's
File('Pleac/data/blue.txt')
client.retrieveArticle(first)?.eachLine{
setDefaultIfNullOrEmpty(null)
resource
checkBoxMenuItem
[m[0][1],
/DIR\
Collections.shuffle(lines)
BuggyMathLib
${options.argumentsOf('o')}"
line[0][0..<[25,line[0].size()].min()].padRight(26)
input(type:'hidden',
unexpand(s2)
FixNum(value)
DragDropCellRenderer(this))
pretty(factorize(239322000000000000000000))
file.size().toString().padLeft(12)
IO
f1.start()
jumped
org.apache.commons.net.WhoisClient
"PostingPermission
'drink'
(!found
["3",
[[null,
logins
from.renameTo(to)
'Click
title('Ice
Expando()
deck,
someone@spam.com
many
0..1000)
fileset(dir:'.',
label("Expiry:
returnCount)
[['Z',
supportedFlavors
"for
(shirts
can't
[zero]
(ch.isSpecialCode()
printf("%5d
['Unknown',
page.titleText.startsWith('The
yz!
fileMode
better
Address:
ftp.retrieveFile(
Address1
Address2
out(['<origin>',
'Paste')
buildAbbrev(words)
menu(mnemonic:'O',
not']
file.delete()
DateFormat.MEDIUM)
'File
$hours:$minutes:$seconds)"
thefunc()
(++count
FixedArray
Toolkit.clearScreen(screenColors)
capWords[it][1]
string[1..-2]
PLEAC.
${x
-7,
findAction(ans)
Jolt
["Apple",
blah
ascii
Employee(name:'Jack',position:'Engineer',salary:22000)]
}.join('||')
draggedIndex)
element,
token',
DateFormat.getDateInstance(DateFormat.FULL,
AutoMap
write(bytes)
createPiperThread(r2,
startsWithCapital
undefined
clobber
0..<numThreads)
5**18
preOrder()
~states.collect{
217
(x
finder[0][1]
(p
"Fruit"
21,
"n":1,
floorExpected[i]
(I
a.value().'age'
"fox"
pop3.logout()
ChoiceFormat('0#are
(8
(termcap
(0
html.titleText
world
Example
abort'
greeting('dick')
abort"
newnode.size
DuTree(input:duProcessFakedInput)
abort:
'b',
wtmp
FileInputStream(f),
count:answer[0],
ingestedColor.values().sort().unique()
toPage("Cancel")
PARA,
0.03s
anonList[(3..5).step(1)]
exit
'Failed')
'food',
db.eachRow("SELECT
report(key,
SPC.VERTICAL_SCROLLBAR_ALWAYS,
'com.ibm.db2.jcc.DB2Driver',
SimpleDateFormat("yyyy-MM-dd")
addresses.collect{
jcurses.system.InputChar
textfield("shirt_count")
"123456789"
package
pat2perm(pat)
Check
Message
choice.format(3)
d1)/1000/60/60/24/365
otherperson@somewhereelse.com
sourceBeforeTarget
one()
(files.any{
${finder[2][1]}
Date().time
SwingBuilder().frame(title:'Demo')
listModel.addElement(it)
String(incoming.data,
commands[cmd]()
td(it)
complete
Arrays.sort(doubles)
<H1>Chapter
Title</title></head>
File(filename)
${n+1}
nonlap[it]
'X':
'X';
fakedInput.split('\n').each{
$doll
(!ignoreErrors)
:rofix
0..<anonList.size())
b.salary
Employee3
Employee2
Thursday
bundle.'PREV'
(!sweaters
dte)
to.canonicalPath
Nat:24,
a1
a2
"file
preppy
having
nonlap.count
consider
client.selectNextArticle()
($d):($d):($d)"
mno
generalPattern
"Theodore"
[filenames]
['red','blue','green'].each{
checkout(active)
kid.size
string[13..-1]
ANSIBuffer.ANSICodes.attrib(40)
page.getFullyQualifiedUrl(url)
is,
message'
age[key]!=null)
'').replaceAll(/\s+$/,
#:
proc.text.split('\n')
t0
large
Sent:
[system:system,
$days
choice.format(numCenturies)
matches"
channel.position(origpos)
USER
pass
hour;
("SEND"
"Like")
'Jeff'
file.absolutePath
[e.value,
<modelVersion>4.0.0</modelVersion>
display)
hours
methRef(2,3)
(previous)
"potam",
${list.size()}
sender
args[0]"
wrap(input,
'Puce',
(swing.name?.text)
createReader(readFromStream)
channel.truncate(size)
username='$user'")
(!seen.contains(path))
16716
label("State:
(myDb.get(tx,
select
--Elizabeth
matchAny(line,
Person8(parent:this,
entry.value.size()
'omega',
Integer.toString(54,
groovysoap
output.withWriter
(float)
"DEUG:
"a":2,
aList.firstArticle
button(actionPerformed:{System.exit(0)},
datafile.eachLine{
Total',
items.sort().reverse()
use(ArrayListCategory)
sense
lines.save()
07:16:20
letters.each{
myAddress
'T'
creme')
Thread.sleep(500)
f.canonicalPath}
File(System.getProperty('user.home')
'/usr/bin/bash'
(after
random1.nextInt()
it}
df.setTimeZone(TimeZone.getTimeZone('GMT'))
<html>
'one'].collect{
its
Date((long)(row.getValue(key).toLong()/1000))
tryCreate(200)
Math.log(val)/Math.log(base)
ingestedColor
simpleCommentStripper
it.
Birthday:
URG
remotePort,
<EASY>&<FUN>"/,
("wc
(o_tcount)
"verbose
productArray
yearWeek
found[8..9]).join())
targets.collect{
all,
$color\n"
'Found:\n'
org.apache.commons.math.complex.Complex
client.login(
String)
to:/\1_4.\2/)
tree.output(tree.topdir)
operation
really
o_invert
directTriple(arg)
"Message".getBytes("ASCII")
1H0fwX-0003c0-GA
(waittime
getTransferDataFlavors()
'-')"
blue'
'labelled'
$urls
items.sort{
(16,
silk,
textfield("sweater_count")
m.getSimilarity(target,
${x+y}"
'*')
'otherFile.txt',
java.lang.String
actionPerformed:{System.exit(0)})
p('Enter
unpack(String
s.postCount++
'##'
[_saved]
other)
"exclude
Shuffle
D8CCBFDE3;
line[6..-1].trim()
~'^0x\\d+':
does:'Poet
${host?host:'unknown'}
head,
Click
employees.values().sort{byAge}.each{
server:'ftp.hypothetical.india.org',
(isTargetCell)
!('123.456.789'
cleverness
self
'Format')
also
it.hrefAttribute
understand.
'pslist.exe'.execute().text
Date(time
BinaryTree
(info
'Card'
items[1..-1]
File("$path")
Boolean
dragged
alias-someone@somewhere.com.au
Random().nextInt(100)
ftp.changeWorkingDirectory(
lines.each{
StaticPerson(name:'Jason',
liNE".replaceAll(/\w+/){capitalize(it)}
java.nio.*
'h/hpsux.html'],
failed
inputFile.text.size()
add(value)
begins
store.select(LoginInfo.class).collect{it.name}.sort())
d.month,
toPage(name)
anonList)
weeks,
logfile
FileOutputStream(File.createTempFile("pleac8",
rand.nextInt(20)
deepcopy(oldlist)
(favorite)
'T-Shirt'
textfield("Zip")
byage.each{
(0..99).each
river
'abcd'))
'http://jakarta.apache.org/'
For
sep
DateFormat.SHORT
ext(it)
A6",
check([1,
getSizeMostOfTheTime('The
lists.collect{commify(it)}.join('\n')
currently
input.replaceAll(findUrls,'<a
'(?m)^'
Man.
'Mother
name="jar"
address.hostName
PetLover(name:'Jason',
"Maddog"
SimpleDateFormat('hh:mm:ss
4:35:25
perms.join('
setDefaultIfNullOrEmpty('')
'big
"RedBlackRedBlackRedBlack"
'show
findAction('e')
's'
).withOptionalArg().
destfile="${build}/jar/Greeter.jar"
/(?i)\bovines?\b/
ValidatingPerson(age:arg).printAge()
Integer.parseInt('101',
s.println('>
stream?.close()
java.awt.datatransfer.*
Carrot:
channel.read(buf))
format,
(file.directory)
/usr/local/lib'.split('
'Lemon'],
50'){
)}
"Texas":
fakedFile
'angry'
"green",
printWriter
Mac?
'Circle')
/a/)
*.data".execute()
pressed
file.lastModified()
Cola
m[0][3]]
label("Address:
mkcounter(20)
triple
Line'
br.readLine())!=null)
(/(\w+)(\s+fish\b\s*)/)
"Hello"
${given}."
b[-2]
dropDown("shirt_size",
4595
Name:
Person9(friend:first)
firstSender
dragged)
FilterOutput(Closure
picks
yet"
localAddr,
sb[2..-3]
it.toInteger()
"Tim"]
objects."
string[start..end]
2\n"
/(?:\w+\s+fish\s+){2}(\w+)\s+fish.*/
'temp.txt'
org.apache.commons.lang.builder.*
ON
start-1
Date().floatTime
value="src"/>
serverTimeZoneConfig:'India/Calcutta'){
hash].each{
File('/createme')
b,
pals
key']
(name)
8130
that.\"/
132,
POLL
RandomAccessFile(lastlog,
'l/linux.html'],
"teasing",
postingPerm
['Chartreuse',
"y"
bg
telnet.connect(
basedir="${build}/classes">
3:"Mar"]
(names
totals.values()
/(\b\p{Lower}+\b)/
matched.each{
div(other)
'n';
method)
key',
marbleColors
'A'],
[millis:System.currentTimeMillis(),
Josh:17
fact(data.size())
prevayler.putAt(val,val*2)
chunks"
2:'b'])
'Date
POGO().metaClass.methods*.name)
into
subdirectories.
getListCellRendererComponent(JList
/(?i)\boh\s+my\s+gh?o(d(dess(es)?|s?)|odness|sh)\b/
spam
long'
unexpand(s)
unless:'testMode')
client.verify("jetson")
/pics/wpaper.gif
User
3600
name.replaceAll(/\/[^\/]+$/,'')
m[0][1].size()
server.
Jeff
'src'
Jubal:'Lamech',
us
ul
hex:
request.getParameter('PARAM_NAME')
ftp.storeFile(
deliverMessage()
age:2)
urls.each{
outChannel
hood'
LWP
getDb(){
HashMap(oldmap)
'D';
urlInfo
string.size()
JFrame('Line
groups.keySet().toList()[0..1].each{
myFile.txt
"default:break\n}\n"
0..9)
label("
'localhost'
groovysoap/lib
items[0..1]
evaluate(new
Jim
existing
$name!"
'org.postgresql.Driver',
switch(line)
to:'*1.groovy.bak')
tryCreate('Youngish')
getLong()
(0..<capwords.count).collect{
b].flatten().collect{
sent
result:
(name.startsWith('|'))
"me@myisp.com"
'not
07:16:24
saveArray(ary)
freemem:freemem,
ch)
'Options'
/(\w+)\s+fish\b/
iList.collect{
(url
this.val
59)
"Don't
foods'
tee.println(line)
SimpleSMTPHeader(
${biggest.size()}
Response')
"Red";
File('/from.txt')
'Dog'
(reversed)
['C',
tokens[0]
CHLD
x+y
swing.createDialog(title:'Entry')
"Problems
junk.txt'
buffered
p.age
/(?m)^Date:\s+(.*)/)
File(name).renameTo(new
//ftp.login(
1)..0).each{
createWriter(System.out)
b.name[0..1]
NumberFormat.getInstance().parse('abc')
unknown:
n[idx]
>]+?)[
CanFlicker()."$methname"(10)
folks
String(response.data,
textField(columns:12,
baby
'orange'
world\r')
'Paul'
["Norbert",
1.48
1.47
myHash[1..3]
0..<lines.size())
water!
tree.processInput()
b.p('Unknown
toInteger(nums)
this.stream
String(b
URL(urlStr).text
20.times
li(type:'disc',
this.object
['A'..'Z','a'..'z','0'..'9',('!@$%^&*'
Search')
overridden
').replaceAll(/
lines,
lines)
Class.forName('sun.jdbc.odbc.JdbcOdbcDriver')
"bo
'f';
dir="${build}"/>
One
/\\u0061\\u0300/
HashMap(100,
stop"
HashMap(100)
mkcounter(77)
[record]
Integer('35')
36days
<groupId>commons-lang</groupId>
!('abc'
201,
s.totalBytes)
mylist.collect{
'ARE'
a1.size()
cli.o(longOpt:
/(?=(\d\d\d))/)
Socket("Machine
Sender
WAITING
"e":4]
['Pleac/src/abc.java',
'Pleac/src/def.groovy']
bar
whither
"thIS
Math.log10(10000)
"Kid's
'beta'
fileset(dir:'Pleac/src',
[5,6,7],
fakedWhoInput.grep(~/^$name\s.*/)
([138.130.127.127])
t.start()
commify(marbleColors)
str.replaceAll(found[0],
Date(buf.getLong()))
ant.mail(from:'manager@grumpybank.com',
threads:")
fileset(dir:'dist'){
groovysoap/src
dropDown("sweater_size",
baa
"Arrow"
'$1')
datafile.withOutputStream{
'balast'
myHash[it]
DragGestureListener
02:14:58
02:14:59
b.h1('Hi!')
inner()
s.totalBytes
45)
have'
Renée
"config@myisp.com"
simplePermute(['dog',
appendFlag
processWtmpRecords(file,
request.getParameter('WHO')
'username',
it.reverse()
this.metaClass.invokeMethod(this,
myDb.delete(tx,
'Unable
dtde.transferable.getTransferData(localDataFlavor)
col(n,
\t]+)/,
foodColor['Lemon']='yellow'
[1000:'M',
firstDate,
checkUnicode('\u0061\u0300')
shrinks
invokeMethod()
2.times{friends.remove(0)}}
ByteBuffer.wrap('Hello'.bytes)
downline(person)
[0:'Green
0..<productArray.size())
<artifactId>commons-lang</artifactId>
"pumpkin"]
${x*y}"
*:
/\u0061\u0300/)
ValueRing
plus
"onetwothree"
string.replace('ppopotam','bisc')
s.close()
b.toLong()}
oldmap
"$m.sentDate:
page.anchors.each{
"$astr
it/*.toString()*/
caption('Cities
361535725
LoginInfo
"config@myisp.com",
groovysoap/src/test
$m.subject"
Type.PTR,
hstrut()
'20'].sort()
3',
riding
"Connected
/sheep/
Person6(name:'Jason',
means
'c:/usr/temp.txt'.replaceAll(/^.*\/{1}/,
/by\s+(\S+\.\S+)/)[0][1]
'is'
colWidth
"""(?ix)
s.findInLine(/(.{5}).{8}(.{5})
Registration
printMessageInfo(new
response.length)
Properties())
dialog
[["X",
end.
textfield("Phone")
error
(key
stream)
vms
form.getInputByValue('CPAN
PI
PM
[this.class.name,
pop3.connect(server)
Paul,
other.m
leftShift(value){
a.add('dog')
StringTokenizer(finder[it][1],'\n').countTokens()}
"Carrot",
staff.find
'help'
exclude(name:'**/pleac??.groovy')
fakedWhoInput
to:'*3.xml')
('A'..'Z').each{
true\n"
byage[record["age"]]
["hippo",
')}"
((found[1..6]
occasionally...
get(name)
args[it]
File('path_to_somewhere_to_delete')
'$3$2$1')
Jabal:'Lamech',
ballast
ls
"somefile"]
c,
files')
c2
c1
foodColor.keySet().sort()
'Hannibal')
Number
myMethod
integerPattern)
-0800]
(numlines--
dad
w.write(it
(n+1)
Thread.sleep(delay)
sad:
a.add('cat')
pattern"
//implicit
COUNT,
greeting('tom')
line.toLowerCase()
getOrCreateNode(parent).kids
'$favorite'.")
pattern:
Soundex()]
-rowinc
para.replaceAll(/(http:\S+)/,
infinite
'w';
off
System.err.println("usage:
Programmer'
[millis,
v.'title'
telnet.inputStream.newReader()
'org.hsqldb.jdbcDriver',
"C"],
0x5bb5580
$count"
'Print')
Oh,
13:36m
df2.format(cal.time))
createPiperThread(br,
keep.println(next)
/cards.html/),
testfile.text.split(/@@pleac@@_8./i).size()
"Sebastopol",
Collins",
aref1
"<p>\n$para\n</p>"
"important"]
css,
people.each{
setChildName(value)
id:'name')
*=flattening
store.selectSingle(LoginInfo.class,
highestEngineer.salary
destdir
s.homeCount,
/$1/+it.toUpperCase())
['someuser@somehost.com',
super.size()
label("Credit
A2",
"Now",
File('README.txt')
m.triple(10)
surname.findAll{
'com.microsoft.jdbc.sqlserver.SQLServerDriver',
Form')
STOP
DragDropCellRenderer(ddlist)
'',
images)')
(count.containsKey(it))
']':']'
side2)
$214.40/
/(\d+\.?\d*|\.\d+)/
'C';
(includeStdout)
hypotenuse(3,
place.
{one
(obj.metaClass.methods*.name
tab.VILLAIN
FileInputStream(inputFile)
11**2'
problem
private,
n.replaceAll(/\G
hasAtLeastSize(20)
["Is
"aAzZ'z-z0z"
URL:
v.sum{it.hosts.size()},
p1.size()
trim,
"POST
["fox",
lookup
0..<maxrow)
emp.position
February
request.getParameter('Name')
System.getProperty('os.name')
in"
non-whitespace
cal.set(2000,
'rainmaker.wunderground.com',
/sh$/')
"accounting.data"].execute()
47,
client.retrieveArticle(aList.lastArticle)?.eachLine{
foodColor.keySet().intersect(citrusColor.keySet())
report('Grand
DateFormat.getDateInstance(DateFormat.LONG).parse(date)
13731
word[0]
trickier
'foo'
engineers.size()
binfile.withObjectOutputStream{
Thread.sleep(delayMillis)
Boutell'
p.setPeers(["Wilbur",
FileOutputStream("error.txt")))
A(name:'My
'A*'
Debugging
socket.receive(response)
Transferable
params[0]
triple(n)
flicker(arg)
File(file).setLastModified(origTime)
/(([0-9]{1,3})|([a-zA-Z]{2,3})|(aero|coop|info|museum|name))>?$/
cmd
MN'.split('
b=[];
String[]).collect{it.next()}.join()
findUrls
client.listNewsgroups()
sql.query("SELECT
TTIN
(seen.containsKey(w))
fact
POGO{}
above
item"
(problemFileNames)
lines.add(1,
25]
LS)
defaultCloseOperation:WC.EXIT_ON_CLOSE)
/\PM\pM*/)
Tuesday
byname
items.reverse()
xmlns="http://maven.apache.org/POM/4.0.0"
"$empl.name
logn(2,
$delCnt
iList)
counter1
counter2
df1.parse(input)
DON'T
inittab
creditCard(active)
Larry","a
Programmer',
tolist:'innocent@poorhouse.com',
cpath
drop(DropTargetDropEvent
field.setValueAttribute('DB_File')
WordReplaceFilter(b,
One')
patterns.any{
'Nash']
'192.168.000.001'
algorithms.
((char)27
'clean
8,9,
th(colspan:3,
$paras
555
menu('Object
550
'groovy'
postCount
55)
$param
'20'].sort{
Apple:
pretty(factorize(2178))
URL('cnn.com/not.there')
str)
15:37
rewind
${value}
"blueberry",
saveArray(['important'])
testPath
colorList)
attributes.setValue(idx,
x/y
below.')
green
Socket("localhost",
ansi(0)
order
the'
BufferedOutputStream(proc.out))
push(list,
"${e.key}:
'0.255'
suffix
background.
FileOutputStream(outFile,
CanFlicker
safe
upline('Irad')
[8,
bytes.size()
37,
iae)
sum(1,2),4,5
'-36'
45,
people.each
[1:'Jan',
/^[\w/+special+/]+$/
/^[01]?[-
'serverFilename',
96176750359
(astart
'''.trim().split('\n').toList()
(a1
(a2
Toming:
"db2",
Transaction
put(v,n)
September'
defaultValue)
year.'
TeeTarget(OutputStream
September
locationToIndex(dge.dragOrigin)
vessel'
+?
tsevens
test..."
(lower.startsWith("from:
DuNode
A*'
channel.write(buf)
CounterHelper
Class.forName(driver).newInstance()
Date(getInt(buf,4)
lines[1..-1]
LoginInfo()
File('Pleac/data/props.xml').withOutputStream{
http://www.cnn.com/not.there
FREEZE
char[])
random.channel
dog'
Theresa',
cut2fmt([8,
\n').each{
rewrite
v.'age'
s1-1
request.getParameter('Number')
script)
"$urlStr
get(buf)
FileReader('Pleac/data/history.dat')
'BAD'
FixNum(40)
<i>that</i>
args[0]"'.execute()
luxury
File('/usr/bin').eachFile{
content)
BufferedOutputStream(fos)
content'
lines.add(3,
String(theKey.data,
Symbols().shortWeekdays.toList()[1..7]
linesByPid[0])
'Quit')
articles"
delCnt
{www.perl.com/208.201.239.36,
button('Cancel',
maxcol])
Lemon:
responded
d,
(target
foodColor.keySet().toList()
CONT
letters.addAll((it
fileset(dir:'htdocs/manual'){
d1
hidden("shirt_size",
simpleNested
match)"
size.toInteger()
5:'V',
File(inputPath
happiest
greeting(s)
deepcopy(mylist)
t0)
"key2"])
numItems
emp
"+threadArray[i])
report(a,
v.sum{it.totalBytes}
w/
((lines.size()
/s)
w2
w1
"Fri",
""Don''t
myAddress.hostName
/\w/
BUS
urlInfo[df.parse(lastModified)]=url
props
command.stop()
left.postOrder()
buf1
File(dir).eachFile{
users;'
reset('Begin
testfile.splitEachLine(/\W+/)
Jules:25,
"Berkeley"
Scanner(data)
convertEscapeToChar
2',
peacefully
button('Quit',
{s[0].toUpperCase()
/<strong>$1<\/strong>/)
it.toLowerCase().trim()
${param('sweater_size')}
"$k=$v"
"l":5,
removeLeadingSpaces
wide"
yeslap
text/plain;
wide'
soundex.soundex('Smyth')
Fresca'.split('
(shirts)
pidIdx
//ftp.retrieveFile(
http://groovy.codehaus.org
newsgroups"
"<html><body>Hello
fakeAddress
/.*sheep.*/
joptsimple.OptionParser("vDo::")
org.apache.commons.codec.language.Soundex()
dir.eachDir{
Sender:
(!whole)
b.h1("Ordered!")
7bit
http://maven.apache.org/maven-v4_0_0.xsd">
Y
["somefile"]
jangle
"$food
'oracle.jdbc.OracleDriver',
1973
1970
$33.00'''
'Cat'
/asctortf/
File('/doesnotexist').exists()
dse)
quoted
flattenmapper()
expectedArray[i]
"Post
GroovyShell().evaluate(metaUnderscore
writer.println(next)
linesByPpid
regexpmapper(from:/^(.*C2)\.(.*)$/,
's')
thefunc(args.start,
's',
$it".toString())
's']
"</FONT>"
Programs
required,
required.
{groovy.codehaus.org/63.246.7.187}
["-30",
getYearOfBirth()
/One
"You're
Reader
tsevens.size()
born
f1.close()
duProcessFakedInput
this.places
/(?:^.*bell.*lab)|(?:^.*lab.*bell)/)
oldarray.clone()
parseDate(m[0][1])
1).downto(0){
$j"
$aList.articleCount
send:
0..<numPermutations)
send"
(remains
obj
'i';
Person(47,
ceilExpected[i]
groovy.text.SimpleTemplateEngine()
myProcessing(file)
Make
'm/microslothwindows.html'],
morkDocument
(when
[27/Apr/2000:00:23:50
Date(youngest.lastModified())}"
p('Please
(father.containsKey(person))
4005
Info',
numThreads
"!"
colorList[i]))
StoreTransaction
ANSIBuffer.ANSICodes.attrib(code)
hidden("shirt_color",
depends="compile">
value="Greeter"/>
(m.find(16))
upline(person)
1',
first.friend
createReader(is)
18/Jan/1973,
vwx
inclusive
writeEmbeddedInfo()
guessed
NumberFormat.getInstance().parse('33.5')
"archive
a+b+c*2
Complex(3,
listModel
"($d)/($d)/($d)
\'Maddog\'
Message".getBytes("ASCII")
Saturday
(you
ch.isSpecialCode()
(!o_noname)
'blue']
EOF
global
pat.size()).collect{
(!x.contains('SYDNEY'))
entry.size()
Comparable
showSelected,
java.util.regex.Pattern
messages")
File('Pleac/data/plain.properties')
hidden(name)
prettyDate(firstDate),
run")
entries
blast
[[1,2,3],
something')
wholeTextFile
URL(address).openStream()
-4.0]
chthon
PEEP'
George
"Content-Type:
expect.spawn("program
'Phantasm',
File('Pleac/src/SlowCat.groovy').eachLine{
tryCreate(20)
cost
$naughty,
1:'Elephant',
lowords
101'
HeadMethod(url)
staff
00:01'
bundle["LAST"]
println("Diagnostic
101]
commify()
w)}
checkAccess(x)
BigInteger
incoming
VERBOSE
INT
comfortably.
101}
wolf'
old'.replaceAll(/\d+/,
"http://www.python.org/",
7:58am
string'.class.class
list.size()
endplus1
<b><i>me
MailHopDelta(sampleMessage).process()
NOMATCH,
market
'çéüßöñàæï?'
end:20,
(factors[x])
First
bindAddr)
"Plano",
0..<colorList.size())
"deputy
multiplyAndAdd
milliseconds"
request.getParameter('flavor')
value:param(name,''));
decked
Pattern.quote(c))
flavor:
PetLover2(name:'Jason',
FilterOutput(quote);
surname;
trans
dedicated
attribute
getCookieValue(cookies,
didn't
substring
abort
subject(m).replaceAll(/(?i)Re:\\s*/,'')
colors[1..-1]
store.select(Person.class)
[3.3
positional
client.verify("george")
messages.sort{
aValidButNotVeryUsefulObject
perms)
to/,'check
pqr
CANCEL
filters)
rev.remove('Azul')
("HAL"
java.text.DateFormatSymbols
approx
].flatten()
93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000
checkUnicode(s)
response.addCookie(oreo)
<b><i>
multiline
File(name).eachFileRecurse{
NumberEcho
newInfo
COLOR='$name'>"
entry.isFile()
nor
TSTP
